ror/app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`admin`, `created_at`, `email`, `encrypted_password`, `name`, `salt`, `updated_at`) VALUES (NULL, '2013-02-19 13:59:27', 'user@example.com', '66da51e7ff38291f2c2b68dde729312ff6b6e8e45d5276d9b4151bd291d3ea51', 'New User', '0f810521d840831d305eba39063ae19b55aeb3755c2a8bb9eea2f794b440de8b', '2013-02-19 13:59:27')

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE `users`.`id` = 42
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1